# GetClearAfterRollback Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureHandlingOptions..::..GetClearAfterRollback Method
FailureHandlingOptions Class See Also
---
Obtains the flag indicating if all posted failures should be removed silently when transaction is being rolled back.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool GetClearAfterRollback()
```

Visual Basic
---
```text
Public Function GetClearAfterRollback As Boolean
```

Visual C++
---
```text
public:
bool GetClearAfterRollback()
```

# ### Return Value
True to clear posted failures silently if the transaction is being rolled back, false to keep these failures in place (they may be displayed to the user).
# See Also
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace